//柱形图模块:各民族分布比例
(function(){
	var myChart = echarts.init(document.querySelector('.chart1'));
	var option = {
		title: {
		    text: "少数民族各民族人口数量",
		    textStyle: {
		      align: "center",
		      color: "#ffaa00",
		      fontSize: 20,
		    },
		    top: "3%",
		    left: "20%",
		  },
		tooltip: {
			trigger: 'axis',
			axisPointer: {
			//type: 'cross',
			label: {
				backgroundColor: '#6a7985'
				}
			}
		},
		grid: {
		  top: "10%",
		  left: "12%",
		  bottom: "10%"
		  // containLabel: true
		},
		xAxis: {
			type: 'category',
			data: ['壮族','维吾尔族','回族','苗族','满族','彝族','土家族','藏族','蒙古族',
			'布依族','侗族','瑶族','白族','哈尼族','朝鲜族','黎族','哈萨克族','傣族','东乡族',
			'傈僳族','畲族','仡佬族','拉祜族','水族','佤族','纳西族','羌族','土族','仫佬族',
			'柯尔克孜族','锡伯族','撒拉族','景颇族','达斡尔族','布朗族','毛南族','塔吉克族',
			'普米族','阿昌族','怒族','鄂温克族','京族','基诺族','保安族','德昂族','俄罗斯族',
			'裕固族','乌孜别克族','门巴族','鄂伦春族','独龙族','赫哲族','珞巴族','塔塔尔族','高山族'],
		},
		yAxis: {
			type: 'value',
			axisLabel: {
			  show: true,
			  formatter: function(value){
				  return value/10000 + "万"
			  }, //右侧Y轴文字显示
			  textStyle: {
			    color: "#ff5500",
			  },
			},
		},
		dataZoom: [
          {
              id: 'dataZoomX',
              type: 'slider',
              filterMode: 'filter',
			  height:20,
			  start: 0,
			  end: 20 ,//初始化滚动条
          },
      ],
	  grid: {
	                bottom: '70px',
	            },
		series: [
			{
				data: [19568546,11774538,11377914,11067929,10423303,9830327,9587732,7060731,
				6290204,3576752,3495993,3309341,2091543,1733166,1702479,1602104,1562518,1329985,
				774947,762996,746385,677521,499167,495928,430977,323767,312981,281928,277233,
				204402,191911,165159,160471,132299,127345,124092,50896,45012,43775,36575,34617,
				33112,26025,24434,22354,16136,14706,12742,11143,9168,7310,5373,4237,3544,3479],
				type: 'bar',
				itemStyle: {
				            normal: {
				　　　　　　　　//这里是重点
				                color: function(params) {
				                	//注意，如果颜色太少的话，后面颜色不会自动循环，最好多定义几个颜色
									var colorList = ['#c23531','#2f4554', '#61a0a8', '#d48265', '#91c7ae','#749f83', '#ca8622']; 
									    return colorList[params.dataIndex % colorList.length];
				                }
				            }
				        },
				tooltip: {
				        valueFormatter: function (value) {
				          return value + ' 人';
				        }
				      },
			},
		],
  
};
myChart.setOption(option);
	window.addEventListener("resize", function() {
		myChart.resize();
	});
})();

//折线图模块：民族自治地区汉民族少数民族人口变化
(function(){
	var myChart = echarts.init(document.querySelector('.chart2'));
	var option = {
		title: {
		    text: "少数民族自治区域人口变化趋势",
		    textStyle: {
		      align: "center",
		      color: "#aa0000",
		      fontSize: 20,
		    },
		    top: "1%",
			left:"20%",
		  },
			tooltip: {
				trigger: 'axis',
				axisPointer: {
				//type: 'cross',
				label: {
					backgroundColor: '#6a7985'
					}
				}
			},
			legend: {
				data: ['总人口（万人）', '少数民族人口（万人）', '占比（%）'],
				top: "12%",
				left:"5%",
			},
			grid: {
				left: '3%',
				right: '4%',
				bottom: '3%',
				containLabel: true
			},
			xAxis: [
				{
					type: 'category',
					boundaryGap: false,
					data: ['2015', '2016', '2017', '2018', '2019', '2020']
				}
			],
			yAxis: [
				{
					type: 'value'
				}
			],
			series: [
				{
					name: '总人口（万人）',
					type: 'line',
					stack: 'Total',
					areaStyle: {},
					emphasis: {
						focus: 'series'
						},
					areaStyle: {
					  color: "rgba(65, 147, 255, 0.2)",
					},
					data: [19089.32,19218.39,19141.3,18943.33,21566.93,18617.7]
				},
				{
					name: '少数民族人口（万人）',
					type: 'line',
					stack: 'Total',
					areaStyle: {},
					emphasis: {
					focus: 'series'
					},
					areaStyle: {
					  color: "rgba(255, 170, 0, 0.2)",
					},
					data: [9269.22,9801.26,9774.64,9804.55,9467.39,7633.28]
				},
				{
					name: '占比（%）',
					type: 'line',
					stack: 'Total',
					areaStyle: {},
					emphasis: {
						focus: 'series'
					},
					areaStyle: {
					  color: "rgba(170, 85, 127, 0.2)",
					},
					data: [0.485,0.509,0.510,0.517,0.439,0.410]
				},
			]
};
	myChart.setOption(option);
	window.addEventListener("resize", function() {
		myChart.resize();
	});
})();



(function(){
	// 1实例化对象
	var myChart = echarts.init(document.querySelector('.map .chart'));
	$.get('./data/geo/china.json', function (geoJson) {
			echarts.registerMap('china', geoJson); // 注册地图
			var myData =[
					{name:'西藏自治区', value:87.847},
					{name:'新疆维吾尔自治区', value:57.76},
					{name:'青海省', value:49.467},
					{name:'广西壮族自治区', value:37.521},
					{name:'贵州省', value:36.435},
					{name:'宁夏回族自治区', value:35.955},
					{name:'云南省', value:33.121},
					{name:'内蒙古自治区', value:21.263},
					];
			//自治州
	        var geoCoordMap = {
	            "延边朝鲜族自治州":[129.475647,42.91849],
	            "恩施土家族苗族自治州":[109.488844,30.280684],
	            "湘西土家族苗族自治州":[109.74328,28.320675],
	            "阿坝藏族羌族自治州":[102.230841,31.910171],
	            "甘孜藏族自治州":[101.963371,30.056028],
	            "凉山彝族自治州":[102.267753,27.890051],
	            "黔东南苗族侗族自治州":[107.985423,26.596682],
	            "黔南布依族苗族自治州":[107.523801,26.266059],
	            "黔西南布依族苗族自治州":[104.907891,25.100512],
	            "楚雄彝族自治州":[101.532112,25.05413],
	            "红河哈尼族彝族自治州":[103.379827,23.376631],
	            "文山壮族苗族自治州":[104.221998,23.413158],
	            "西双版纳傣族自治州":[100.799993,22.020838],
	            "大理白族自治州":[100.274008,25.614475],
	            "德宏傣族景颇族自治州":[98.586182,24.443011],
	            "怒江傈僳族自治州":[98.860416,25.830733],
	            "迪庆藏族自治州":[99.704932,27.823907],
	            "临夏回族自治州":[103.21639,35.606858],
	            "甘南藏族自治州":[102.918162,34.987956],
	            "海南藏族自治州":[100.624895,36.293732],
	            "海北藏族自治州":[100.901106,36.959972],
	            "海西蒙古族藏族自治州":[97.366525,37.377014],
	            "黄南藏族自治州":[102.017826,35.526979],
	            "果洛藏族自治州":[100.249871,34.477907],
	            "玉树藏族自治州":[97.011452,33.010253],
	            "伊犁哈萨克自治州":[81.328817,43.927916],
	            "博尔塔拉蒙古自治州":[82.071185,44.916894],
	            "昌吉回族自治州":[87.31155,44.017475],
	            "巴音郭楞蒙古自治州":[86.146537,41.776527],
	            "克孜勒苏柯尔克孜自治州":[76.171438,39.728684],
	        };
			//自治县
			var geoCoordMap2 = {
				"阿克塞哈萨克族自治县":[94.343314,39.638933],
				"巴里坤哈萨克自治县":[93.023506,43.602973],
				"巴马瑶族自治县":[107.260732,24.147],
				"白沙黎族自治县":[109.452872,19.231652],
				"保亭黎族苗族自治县":[109.704632,18.646636],
				"北川羌族自治县":[104.358711,31.961369],
				"本溪满族自治县":[124.102865,41.30682],
				"沧源佤族自治县":[99.247551,23.15208],
				"察布查尔锡伯自治县":[81.153324,43.847314],
				"昌江黎族自治县":[109.05844,19.304817],
				"长白朝鲜族自治县":[128.203558,41.424815],
				"长阳土家族自治县":[111.21351,30.480887],
				"城步苗族自治县":[110.324511,26.396981],
				"大厂回族自治县":[116.992956,39.891544],
				"大化瑶族自治县":[108.003262,23.745201],
				"大通回族土族自治县":[101.690267,36.93382],
				"道真仡佬族苗族自治县":[107.620054,28.866373],
				"东乡族自治县":[103.392736,35.670032],
				"都安瑶族自治县":[108.108579,23.939182],
				"杜尔伯特蒙古族自治县":[124.398191,46.873302],
				"峨边彝族自治县":[103.265707,29.236341],
				"峨山彝族自治县":[102.411418,24.175565],
				"丰宁满族自治县":[116.65124,41.214684],
				"阜新蒙古族自治县":[121.760129,42.072868],
				"富川瑶族自治县":[111.279913,24.818323],
				"耿马傣族佤族自治县":[99.40337,23.549587],
				"恭城瑶族自治县":[110.83226,24.836408],
				"贡山独龙族怒族自治县":[98.672401,27.749881],
				"关岭布依族苗族自治县":[105.624325,25.951695],
				"和布克赛尔蒙古自治县":[85.730406,46.800855],
				"河口瑶族自治县":[103.937972,22.5368],
				"河南蒙古族自治县":[101.616149,34.741108],
				"互助土族自治县":[101.962265,36.849789],
				"化隆回族自治县":[102.268722,36.102156],
				"环江毛南族自治县":[108.26272,24.832349],
				"桓仁满族自治县":[125.36237,41.273142],
				"积石山保安族东乡族撒拉族自治县":[102.878493,35.726076],
				"江城哈尼族彝族自治县":[101.867333,22.589282],
				"江华瑶族自治县":[111.585453,25.190563],
				"金平苗族瑶族傣族自治县":[103.231895,22.785293],
				"金秀瑶族自治县":[110.197805,24.137639],
				"景东彝族自治县":[100.838486,24.450548],
				"景谷傣族彝族自治县":[100.708878,23.510892],
				"景宁畲族自治县":[119.642427,27.97981],
				"靖州苗族侗族自治县":[109.701302,26.582097],
				"喀喇沁左翼蒙古族自治县":[119.722691,41.140861],
				"宽城满族自治县":[118.49159,40.618684],
				"宽甸满族自治县":[124.776055,40.753078],
				"兰坪白族普米族自治县":[99.421561,26.459983],
				"澜沧拉祜族自治县":[99.934566,22.563167],
				"乐东黎族自治县":[109.181658,18.756693],
				"连南瑶族自治县":[112.294091,24.732336],
				"连山壮族瑶族自治县":[112.099275,24.577109],
				"陵水黎族自治县":[110.042739,18.512606],
				"龙胜各族自治县":[110.022527,25.807501],
				"隆林各族自治县":[105.351033,24.778652],
				"禄劝彝族苗族自治县":[102.476851,25.561582],
				"罗城仫佬族自治县":[108.911,24.796469],
				"麻阳苗族自治县":[109.808865,27.873719],
				"马边彝族自治县":[103.55188,28.843002],
				"门源回族自治县":[101.627287,37.384702],
				"孟村回族自治县":[117.112161,38.062341],
				"孟连傣族拉祜族佤族自治县":[99.586365,22.338249],
				"民和回族土族自治县":[102.836964,36.32998],
				"墨江哈尼族自治县":[101.692837,23.431094],
				"木垒哈萨克自治县":[90.290214,43.84343],
				"木里藏族自治县":[101.283524,27.935365],
				"南涧彝族自治县":[100.51382,25.050212],
				"宁洱哈尼族彝族自治县":[101.050144,23.064966],
				"宁蒗彝族自治县":[100.856865,27.289012],
				"彭水苗族土家族自治县":[108.169125,29.300217],
				"屏边苗族自治县":[103.689985,22.989724],
				"前郭尔罗斯蒙古族自治县":[124.846554,45.128911],
				"青龙满族自治县":[118.955331,40.413893],
				"清原满族自治县":[124.928632,42.107402],
				"琼中黎族苗族自治县":[109.841636,19.043265],
				"融水苗族自治县":[109.258537,25.071815],
				"乳源瑶族自治县":[113.283583,24.783121],
				"三都水族自治县":[107.875856,25.98974],
				"三江侗族自治县":[109.613394,25.78857],
				"石林彝族自治县":[103.29881,24.779539],
				"石柱土家族自治县":[108.12271,30.00786],
				"双江拉祜族佤族布朗族傣族自治县":[99.83471,23.47798],
				"松桃苗族自治县":[109.207099,28.162204],
				"肃北蒙古族自治县":[94.885415,39.519444],
				"肃南裕固族自治县":[99.618452,38.844674],
				"塔什库尔干塔吉克自治县":[75.256676,37.773798],
				"天祝藏族自治县":[103.144598,36.97921],
				"通道侗族自治县":[109.786991,26.168629],
				"威宁彝族回族苗族自治县":[104.25201,26.856302],
				"巍山彝族回族自治县":[100.293915,25.212257],
				"围场满族蒙古族自治县":[117.763119,41.947114],
				"维西傈僳族自治县":[99.292313,27.18754],
				"五峰土家族自治县":[111.053153,30.172904],
				"务川仡佬族苗族自治县":[107.905455,28.573898],
				"西盟佤族自治县":[99.594898,22.651989],
				"新宾满族自治县":[99.594898,22.651989],
				"新晃侗族自治县":[109.179746,27.36058],
				"新平彝族傣族自治县":[101.992978,24.079166],
				"秀山土家族苗族自治县":[109.010129,28.45675],
				"岫岩满族自治县":[123.285819,40.296553],
				"寻甸回族彝族自治县":[103.265303,25.56624],
				"循化撒拉族自治县":[102.495958,35.857837],
				"焉耆回族自治县":[86.575469,42.064206],
				"沿河土家族自治县":[108.511057,28.57137],
				"漾濞彝族自治县":[99.963841,25.677078],
				"伊通满族自治县":[125.313781,43.350892],
				"印江土家族苗族自治县":[108.414291,28.0011],
				"酉阳土家族苗族自治县":[108.775158,28.84628],
				"玉龙纳西族自治县":[100.221682,26.828166],
				"玉屏侗族自治县":[108.910856,27.242808],
				"元江哈尼族彝族傣族自治县":[102.003264,23.605386],
				"张家川回族自治县":[106.211394,34.998453],
				"镇宁布依族苗族自治县":[105.788661,26.052144],
				"镇沅彝族哈尼族拉祜族自治县":[101.117868,24.011123],
				"芷江侗族自治县":[109.690828,27.469771],
				"紫云苗族布依族自治县":[106.089836,25.755586],
				"鄂伦春自治旗":[123.730049,50.597032],
				"莫力达瓦达斡尔族自治旗":[124.526622,48.485949],
				"鄂温克族自治旗":[119.759629,49.153234],
			};
			//转自治州的数据
	        var convertData = function (data) {
			    var res = [];
			    for (var i = 0; i < data.length; i++) {
			        var geoCoord = geoCoordMap[data[i].name];//获取坐标
			        if (geoCoord) {//如果有坐标
			        	res.push({//创建对象数组，
	                        name: data[i].name,
	                        value: geoCoord.concat(data[i].value)  //用连接数组的形式将value值加入
	                    });
			            //res.push(geoCoord.concat(data[i].value));
			            //res.push(geoCoord.concat(data[i].name));
			        }
			    }
			    return res;
			};
			//转自治县的数据
			var convertData2 = function (data) {
			    var res = [];
			    for (var i = 0; i < data.length; i++) {
			        var geoCoord = geoCoordMap2[data[i].name];//获取坐标
			        if (geoCoord) {//如果有坐标
			        	res.push({//创建对象数组，
	                        name: data[i].name,
	                        value: geoCoord.concat(data[i].value)  //用连接数组的形式将value值加入
	                    });
			            //res.push(geoCoord.concat(data[i].value));
			            //res.push(geoCoord.concat(data[i].name));
			        }
			    }
			    return res;
			};
			
			// 2. 指定配置项和数据
			var option =  {
			    baseOption: {
			        // 时间进度模块
			        timeline:{
			            axisType: 'category',
			            autoPlay: true,
			            playInterval: '2000',
			            data: ['各地区少数民族占比','少数民族自治州','少数民族自治县'],
			        },
			        calculable : true,
					geo: {
					    map: 'china',
						//zoom: 1.5,
						roam:true,
						layoutCenter:['48%','63%'],
						layoutSize:'120%',
					    itemStyle: {					// 定义样式
					        normal: {					// 普通状态下的样式
					            areaColor:
									{
									  type: 'linear',
									  x: 0,
									  y: 0,
									  x2: 0,
									  y2: 1,
									  colorStops: [{
									      offset: 0, color: '#ffffff' // 0% 处的颜色
									  }, {
									      offset: 1, color: '#fff6e2' // 100% 处的颜色
									  }],
									  global: false // 缺省为 false
									},    //省份颜色
					            borderColor: '#336666',
					            },
					        emphasis: {		areaColor: '#FFDC89'    }			// 高亮状态下的样式
					        }
					    },
			        
			    },
			
			    //各省少数民族占比
			    options: [
			        {
			            
						//提示框
			            tooltip: {
			                    trigger: 'item',
			                    formatter: '{b}<br/>少数民族占比:{c} (%)'
			                  },
						visualMap: {
						        min: 0,
						        max: 100,
						        text: ['High', 'Low'],
						        realtime: false,
						        calculable: true,
						        inRange: {
						          color: ['lightskyblue', 'yellow', 'orangered'],
						        },
								show:false,
						      },
						series: [
			                {
			                name: '各省少数民族占比',
			                type: 'map',
			                map: 'china',
							//roam:true,
							zoom:1.2,
							coordinateSystem: 'geo',
			                data: [
			                        {name:'西藏自治区', value:87.847},
			                        {name:'新疆维吾尔自治区', value:57.76},
			                        {name:'青海省', value:49.467},
			                        {name:'广西壮族自治区', value:37.521},
			                        {name:'贵州省', value:36.435},
			                        {name:'宁夏回族自治区', value:35.955},
			                        {name:'云南省', value:33.121},
			                        {name:'内蒙古自治区', value:21.263},
			                        {name:'海南省', value:15.702},
			                        {name:'辽宁省', value:15.078},
			                        {name:'甘肃省', value:10.617},
			                        {name:'湖南省', value:10.061},
			                        {name:'吉林省', value:8.672},
			                        {name:'四川省', value:6.798},
			                        {name:'重庆市', value:6.772},
			                        {name:'湖北省', value:4.798},
			                        {name:'北京市', value:4.787},
			                        {name:'河北省', value:4.317},
			                        {name:'广东省', value:3.771},
			                        {name:'黑龙江省', value:3.521},
			                        {name:'浙江省', value:3.435},
			                        {name:'天津市', value:3.198},
			                        {name:'福建省', value:2.7},
			                        {name:'上海市', value:1.608},
			                        {name:'河南省', value:1.163},
			                        {name:'山东省', value:0.891},
			                        {name:'江苏省', value:0.733},
			                        {name:'安徽省', value:0.709},
			                        {name:'陕西省', value:0.563},
			                        {name:'江西省', value:0.485},
			                        {name:'山西省', value:0.349}  
			                          ],
			            	symbolSize:10,
							geoIndex: 0,
			                }
			            ]
			        },
					//少数民族自治州
			        {
						//提示框
			            tooltip: {
			                trigger: 'item',
			                "confine": true,
			                "formatter": (p)=>{//自定义提示信息
			                  	let dataCon = p.data;
			                    txtCon =dataCon.name+'<br />'+"主体民族："+dataCon.value[2];
			                    return txtCon;
			                }
			            },    
						series: [
			                {
			                name: '地区总览', // series名称
			                type: 'scatter', // series图表类型
			                coordinateSystem: 'geo', // series坐标系类型
			                data: convertData([
			                        {name:"延边朝鲜族自治州",value:"朝鲜族"},
			                        {name:"恩施土家族苗族自治州",value:"土家族、苗族"},
			                        {name:"湘西土家族苗族自治州",value:"土家族、苗族"},
			                        {name:"阿坝藏族羌族自治州",value:"藏族、羌族"},
			                        {name:"甘孜藏族自治州",value:"藏族"},
			                        {name:"凉山彝族自治州",value:"彝族"},
			                        {name:"黔东南苗族侗族自治州",value:"苗族、侗族"},
			                        {name:"黔南布依族苗族自治州",value:"布依族、苗族"},
			                        {name:"黔西南布依族苗族自治州",value:"布依族、苗族"},
			                        {name:"楚雄彝族自治州",value:"彝族"},
			                        {name:"红河哈尼族彝族自治州",value:"哈尼族、彝族"},
			                        {name:"文山壮族苗族自治州",value:"壮族、苗族"},
			                        {name:"西双版纳傣族自治州",value:"傣族"},
			                        {name:"大理白族自治州",value:"白族"},
			                        {name:"德宏傣族景颇族自治州",value:"傣族、景颇族"},
			                        {name:"怒江傈僳族自治州",value:"傈僳族"},
			                        {name:"迪庆藏族自治州",value:"藏族"},
			                        {name:"临夏回族自治州",value:"回族"},
			                        {name:"甘南藏族自治州",value:"藏族"},
			                        {name:"海南藏族自治州",value:"藏族"},
			                        {name:"海北藏族自治州",value:"藏族"},
			                        {name:"海西蒙古族藏族自治州",value:"蒙古族、藏族"},
			                        {name:"黄南藏族自治州",value:"藏族"},
			                        {name:"果洛藏族自治州",value:"藏族"},
			                        {name:"玉树藏族自治州",value:"藏族"},
			                        {name:"伊犁哈萨克自治州",value:"哈萨克族"},
			                        {name:"博尔塔拉蒙古自治州",value:"蒙古族"},
			                        {name:"昌吉回族自治州",value:"回族"},
			                        {name:"巴音郭楞蒙古自治州",value:"蒙古族"},
			                        {name:"克孜勒苏柯尔克孜自治州",value:"柯尔克孜族"},
			                ]),
			            	symbolSize:20,
							symbol:"pin",
			            	itemStyle: {
			            	        color: '#aa0000', //散点颜色
			            	      },			  
			                }
			            ]
			        },
			        {
			            //提示框
			            tooltip: {
			                trigger: 'item',
			                "confine": true,
			                "formatter": (p)=>{//自定义提示信息
			                  	let dataCon = p.data;
			                    txtCon =dataCon.name+'<br />'+"所属城市："+dataCon.value[2];
			                    return txtCon;
			                }
			            },    
						series: [
			                {
			                name: '地区总览', // series名称
			                type: 'scatter', // series图表类型
			                coordinateSystem: 'geo', // series坐标系类型
			                data: convertData2([
			                        {name:"阿克塞哈萨克族自治县",value:"酒泉市"},
			                        {name:"巴里坤哈萨克自治县",value:"哈密地区"},
			                        {name:"巴马瑶族自治县",value:"河池市"},
			                        {name:"白沙黎族自治县",value:"无"},
			                        {name:"保亭黎族苗族自治县",value:""},
			                        {name:"北川羌族自治县",value:"绵阳市"},
			                        {name:"本溪满族自治县",value:"本溪市"},
			                        {name:"沧源佤族自治县",value:"临沧市"},
			                        {name:"察布查尔锡伯自治县",value:"伊犁哈萨克自治州"},
			                        {name:"昌江黎族自治县",value:"无"},
			                        {name:"长白朝鲜族自治县",value:"白山市"},
			                        {name:"长阳土家族自治县",value:"宜昌市"},
			                        {name:"城步苗族自治县",value:"邵阳市"},
			                        {name:"大厂回族自治县",value:"廊坊市"},
			                        {name:"大化瑶族自治县",value:"河池市"},
			                        {name:"大通回族土族自治县",value:"西宁市"},
			                        {name:"道真仡佬族苗族自治县",value:"遵义市"},
			                        {name:"东乡族自治县",value:"临夏州"},
			                        {name:"都安瑶族自治县",value:"河池市"},
			                        {name:"杜尔伯特蒙古族自治县",value:"大庆市"},
			                        {name:"峨边彝族自治县",value:"乐山市"},
			                        {name:"峨山彝族自治县",value:"玉溪市"},
			                        {name:"丰宁满族自治县",value:"承德市"},
			                        {name:"阜新蒙古族自治县",value:"阜新市"},
			                        {name:"富川瑶族自治县",value:"贺州市"},
			                        {name:"耿马傣族佤族自治县",value:"临沧市"},
			                        {name:"恭城瑶族自治县",value:"桂林市"},
			                        {name:"贡山独龙族怒族自治县",value:"怒江傈僳族自治州"},
			                        {name:"关岭布依族苗族自治县",value:"安顺市"},
			                        {name:"和布克赛尔蒙古自治县",value:"塔城地区"},
			                        {name:"河口瑶族自治县",value:"红河哈尼族彝族自治州"},
			                        {name:"河南蒙古族自治县",value:"黄南藏族自治州"},
			                        {name:"互助土族自治县",value:"海东地区"},
			                        {name:"化隆回族自治县",value:"海东地区"},
			                        {name:"环江毛南族自治县",value:"河池市"},
			                        {name:"桓仁满族自治县",value:"本溪市"},
			                        {name:"积石山保安族东乡族撒拉族自治县",value:"临夏州"},
			                        {name:"江城哈尼族彝族自治县",value:"普洱市"},
			                        {name:"江华瑶族自治县",value:"永州市"},
			                        {name:"金平苗族瑶族傣族自治县",value:"红河哈尼族彝族自治州"},
			                        {name:"金秀瑶族自治县",value:"来宾市"},
			                        {name:"景东彝族自治县",value:"普洱市"},
			                        {name:"景谷傣族彝族自治县",value:"普洱市"},
			                        {name:"景宁畲族自治县",value:"丽水市"},
			                        {name:"靖州苗族侗族自治县",value:"怀化市"},
			                        {name:"喀喇沁左翼蒙古族自治县",value:"朝阳市"},
			                        {name:"宽城满族自治县",value:"承德市"},
			                        {name:"宽甸满族自治县",value:"丹东市"},
			                        {name:"兰坪白族普米族自治县",value:"怒江傈僳族自治州"},
			                        {name:"澜沧拉祜族自治县",value:"普洱市"},
			                        {name:"乐东黎族自治县",value:"无"},
			                        {name:"连南瑶族自治县",value:"清远市"},
			                        {name:"连山壮族瑶族自治县",value:"清远市"},
			                        {name:"陵水黎族自治县",value:"无"},
			                        {name:"龙胜各族自治县",value:"桂林市"},
			                        {name:"隆林各族自治县",value:"百色市"},
			                        {name:"禄劝彝族苗族自治县",value:"昆明市"},
			                        {name:"罗城仫佬族自治县",value:"河池市"},
			                        {name:"麻阳苗族自治县",value:"怀化市"},
			                        {name:"马边彝族自治县",value:"乐山市"},
			                        {name:"门源回族自治县",value:"海北藏族自治州"},
			                        {name:"孟村回族自治县",value:"沧州市"},
			                        {name:"孟连傣族拉祜族佤族自治县",value:"普洱市"},
			                        {name:"民和回族土族自治县",value:"海东地区"},
			                        {name:"墨江哈尼族自治县",value:"普洱市"},
			                        {name:"木垒哈萨克自治县",value:"昌吉回族自治州"},
			                        {name:"木里藏族自治县",value:"凉山彝族自治州"},
			                        {name:"南涧彝族自治县",value:"大理白族自治州"},
			                        {name:"宁洱哈尼族彝族自治县",value:"普洱市"},
			                        {name:"宁蒗彝族自治县",value:"丽江市"},
			                        {name:"彭水苗族土家族自治县",value:"重庆市"},
			                        {name:"屏边苗族自治县",value:"红河哈尼族彝族自治州"},
			                        {name:"前郭尔罗斯蒙古族自治县",value:"松原市"},
			                        {name:"青龙满族自治县",value:"秦皇岛市"},
			                        {name:"清原满族自治县",value:"抚顺市"},
			                        {name:"琼中黎族苗族自治县",value:"无"},
			                        {name:"融水苗族自治县",value:"柳州市"},
			                        {name:"乳源瑶族自治县",value:"韶关市"},
			                        {name:"三都水族自治县",value:"黔南布依族苗族自治州"},
			                        {name:"三江侗族自治县",value:"柳州市"},
			                        {name:"石林彝族自治县",value:"昆明市"},
			                        {name:"石柱土家族自治县",value:"重庆市"},
			                        {name:"双江拉祜族佤族布朗族傣族自治县",value:"临沧市"},
			                        {name:"松桃苗族自治县",value:"铜仁地区"},
			                        {name:"肃北蒙古族自治县",value:"酒泉市"},
			                        {name:"肃南裕固族自治县",value:"张掖市"},
			                        {name:"塔什库尔干塔吉克自治县",value:"喀什地区"},
			                        {name:"天祝藏族自治县",value:"威武市"},
			                        {name:"通道侗族自治县",value:"怀化市"},
			                        {name:"威宁彝族回族苗族自治县",value:"毕节地区"},
			                        {name:"巍山彝族回族自治县",value:"大理白族自治州"},
			                        {name:"围场满族蒙古族自治县",value:"承德市"},
			                        {name:"维西傈僳族自治县",value:"迪庆藏族自治州"},
			                        {name:"五峰土家族自治县",value:"宜昌市"},
			                        {name:"务川仡佬族苗族自治县",value:"遵义市"},
			                        {name:"西盟佤族自治县",value:"普洱市"},
			                        {name:"新宾满族自治县",value:"抚顺市"},
			                        {name:"新晃侗族自治县",value:"怀化市"},
			                        {name:"新平彝族傣族自治县",value:"玉溪市"},
			                        {name:"秀山土家族苗族自治县",value:"重庆市"},
			                        {name:"岫岩满族自治县",value:"鞍山市"},
			                        {name:"寻甸回族彝族自治县",value:"昆明市"},
			                        {name:"循化撒拉族自治县",value:"海东地区"},
			                        {name:"焉耆回族自治县",value:"巴音郭楞蒙古自治州"},
			                        {name:"沿河土家族自治县",value:"铜仁地区"},
			                        {name:"漾濞彝族自治县",value:"大理白族自治州"},
			                        {name:"伊通满族自治县",value:"四平市"},
			                        {name:"印江土家族苗族自治县",value:"铜仁地区"},
			                        {name:"酉阳土家族苗族自治县",value:"重庆市"},
			                        {name:"玉龙纳西族自治县",value:"丽江市"},
			                        {name:"玉屏侗族自治县",value:"铜仁地区"},
			                        {name:"元江哈尼族彝族傣族自治县",value:"玉溪市"},
			                        {name:"张家川回族自治县",value:"天水市"},
			                        {name:"镇宁布依族苗族自治县",value:"安顺市"},
			                        {name:"镇沅彝族哈尼族拉祜族自治县",value:"普洱市"},
			                        {name:"芷江侗族自治县",value:"怀化市"},
			                        {name:"紫云苗族布依族自治县",value:"安顺市"},
			                        {name:"鄂伦春自治旗",value:"呼伦贝尔市"},
			                        {name:"莫力达瓦达斡尔族自治旗",value:"呼伦贝尔市"},
			                        {name:"鄂温克族自治旗",value:"呼伦贝尔市"}
			                ]),
			            	symbolSize:15,
							symbol:"pin",
			            	itemStyle: {
			            	        color: '#aa557f', //散点颜色
			            	      },			  
			                }
			            ]
			        }
			    ]
			};
			myChart.setOption(option);
			window.addEventListener("resize", function() {
				myChart.resize();
			});
			//联动：点击地图上的市区块信息
			myChart.on('click', function (params) {
			    var city = params.name;
			
			    // 获取点击区块的序列号
			    var index = myData.findIndex(function(item) {
			        return item.name === city;
			    });
			
			    // 将点击区块的序列号传递至页面 index1.html 
			    if (window.localStorage) {
			            //存储变量的值
			            localStorage.name = index;
			            localStorage.city = city;
			    		console.log("你好我是");
			    		console.log(city);
			    		console.log(index)
						if(index!=-1){
							if(index==0){location.href = './xizang.html';}
							if(index==1){location.href='./xinjiang.html'}
							if(index==2){location.href='./qinghai.html'}
							if(index==3){location.href='./guangxi.html'}
							if(index==4){location.href='./guizhou.html'}
							if(index==5){location.href='./ningxia.html'}
							if(index==6){location.href='./yunnan.html'}
							if(index==7){location.href='./neimenggu.html'}
							}
			        } else {
			            alert("参数传输失败！");
			        }
			
			});
myChart.setOption(option);
	});
})();